In [51]:
!py -m pip install pandas
!py -m pip install numpy

Requirement already satisfied: pandas in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: numpy in c:\users\elohorefere\appdata\local\programs\python\python313\lib\site-packages (2.3.5)

In [52]:
import pandas as pd
import numpy as np

In [53]:
# load data
data = pd.read_excel("C:/Users/ElohorEfere/Documents/DATA ANALYTICS/PYTHON/space_missions.xlsx")
data.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,NaN,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,NaN,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,NaN,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,NaN,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,NaN,Failure

In [54]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company             0
Location            0
Date                0
Time              127
Rocket              0
Mission             0
RocketStatus        0
Price            3365
MissionStatus       0
dtype: int64

In [55]:
#Fill the Missing Price rows with 0 
data['Price'] = data['Price'].fillna(0)
data.head()

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,0.0,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,0.0,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,0.0,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,0.0,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,0.0,Failure

In [56]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company            0
Location           0
Date               0
Time             127
Rocket             0
Mission            0
RocketStatus       0
Price              0
MissionStatus      0
dtype: int64

In [57]:
data.dtypes

Company                  object
Location                 object
Date             datetime64[ns]
Time                     object
Rocket                   object
Mission                  object
RocketStatus             object
Price                   float64
MissionStatus            object
dtype: object

In [58]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company            0
Location           0
Date               0
Time             127
Rocket             0
Mission            0
RocketStatus       0
Price              0
MissionStatus      0
dtype: int64

In [59]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company            0
Location           0
Date               0
Time             127
Rocket             0
Mission            0
RocketStatus       0
Price              0
MissionStatus      0
dtype: int64

In [60]:
data['Time'].head()

0    19:28:00
1    02:30:00
2    16:44:00
3    03:48:00
4    07:33:00
Name: Time, dtype: object

In [61]:
# deal with Time missing values
# Drop rows where Time is missing
data = data.dropna(subset=['Time'])

# Reset the index if you want a clean sequential index
data = data.reset_index(drop=True)

In [62]:
# Check for missing values
missing_values = data.isnull().sum()
print("Missing Values")
missing_values

Missing Values

Company          0
Location         0
Date             0
Time             0
Rocket           0
Mission          0
RocketStatus     0
Price            0
MissionStatus    0
dtype: int64

In [63]:
# Check for Duplicates
duplicates = data.duplicated()
data[duplicates]

,Company,Location,Date,Time,Rocket,Mission,RocketStatus,Price,MissionStatus
3425,CASC,"Site 9401 (SLS-2), Jiuquan Satellite Launch Ce...",2008-11-05,00:15:00,Long March 2D,Shiyan-3 & Chuangxin-1(02),Active,29.75,Success

In [64]:
# Remove Duplicates
data.drop_duplicates(inplace = True)

In [65]:
# Check for Duplicates
duplicates = data.duplicated()
data[duplicates]

Empty DataFrame
Columns: [Company, Location, Date, Time, Rocket, Mission, RocketStatus, Price, MissionStatus]
Index: []

In [66]:
# standardising the Company column
data['Company'].value_counts().head(20)

Company
RVSN USSR           1717
CASC                 335
Arianespace          293
General Dynamics     249
VKS RF               213
NASA                 203
SpaceX               182
US Air Force         157
ULA                  151
Boeing               136
Martin Marietta      108
Northrop              89
MHI                   87
ISRO                  81
Lockheed              79
Roscosmos             69
ILS                   46
Sea Launch            32
ISAS                  30
Rocket Lab            28
Name: count, dtype: int64

In [67]:
# remove spaces and turn the data in the company column to title case
data['Company'] = data['Company'].str.strip()
data['Company'] = data['Company'].str.title()

In [68]:
# standardising the Date column
data['Date'].head(20)

0    1957-10-04
1    1957-11-03
2    1957-12-06
3    1958-02-01
4    1958-02-05
5    1958-03-05
6    1958-03-17
7    1958-03-26
8    1958-04-27
9    1958-04-28
10   1958-05-15
11   1958-05-28
12   1958-06-26
13   1958-07-26
14   1958-08-17
15   1958-08-24
16   1958-09-23
17   1958-09-26
18   1958-10-11
19   1958-10-11
Name: Date, dtype: datetime64[ns]

In [69]:
# ensures the date column is turned to string datatype before removing extra spaces
data['Date'] = data['Date'].astype(str).str.strip()

In [70]:
data['Date'].head()

0    1957-10-04
1    1957-11-03
2    1957-12-06
3    1958-02-01
4    1958-02-05
Name: Date, dtype: object